# Core tools (matches linux setup.sh)
brew "bat"
brew "coreutils"
brew "curl"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "jq"
brew "midnight-commander"
brew "neovim"
brew "sd"
brew "tree"
brew "unzip"
brew "uv"
brew "watch"
brew "wget"
brew "yq"

# Dev tools
brew "bazelisk"
brew "difftastic"
brew "duckdb"
brew "glow"
brew "gnu-getopt"
brew "gnu-tar"
brew "gnupg"
brew "lcov"
brew "pinentry-mac"
brew "prettier"
brew "pyenv"

# Containers / cloud
brew "awscli"
brew "derailed/k9s/k9s"
brew "kubecolor"

# AI coding assistants
cask "claude-code"
cask "codex"

# macOS apps
cask "alt-tab"
cask "rectangle"
cask "whichspace"
cask "gpg-suite"

# Fonts
cask "font-anonymous-pro"
cask "font-azeret-mono"
cask "font-barlow-condensed"
cask "font-fira-code"
cask "font-ibm-plex-mono"
cask "font-iosevka"
cask "font-iosevka-etoile"
cask "font-jetbrains-mono"
cask "font-roboto-mono"
cask "font-saira-extra-condensed"
cask "font-stint-ultra-condensed"
cask "font-symbols-only-nerd-font"
cask "font-victor-mono"
